simulations/meshing/one_block/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh # create the mesh
# runApplication checkMesh # check the mesh

# runApplication rhoCentralFoam # run the solver 

#------------------------------------------------------------------------------
