simulations/meshing/one_block/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2;
        startFace       12;
    }
    outlet
    {
        type            patch;
        nFaces          2;
        startFace       14;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       16;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6;
        startFace       24;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6;
        startFace       30;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          24;
        startFace       36;
    }
)

// ************************************************************************* //
